---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyzeAs
source: html/3a54ad97-7e93-185f-63e6-c1348ce17395.htm
---
# Autodesk.Revit.DB.Structure.AnalyzeAs

Analyze As has various functions within the Analytical Model, and is Element-dependent.
 "Not for Analysis" usually means that there will not be an Analytical Model generated.
 The others indicate how the Analytical Model behavior will treat the Element in question.
 For instance "Hanger" columns have different support expectations than "Gravity" columns.

## Syntax (C#)
```csharp
public enum AnalyzeAs
```